In [1]:
print("hello world")

hello world

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
brands = pd.read_csv(r"brands.csv")
brands

           pid    BRAND
0        66605  BRAND_0
1        66715  BRAND_0
2        66756  BRAND_0
3        66774  BRAND_0
4        66794  BRAND_0
...        ...      ...
263248  241084  BRAND_9
263249  242220  BRAND_9
263250  248306  BRAND_9
263251  251575  BRAND_9
263252  254937  BRAND_9

[263253 rows x 2 columns]

In [9]:
sim = pd.read_csv(r"sim.csv")
sim

           pid     SIM
0        63422  SIM_14
1        63423  SIM_14
2        63424  SIM_14
3        63425  SIM_14
4        63427  SIM_36
...        ...     ...
102817  176008  SIM_14
102818  176009  SIM_14
102819  176010  SIM_14
102820  176011  SIM_14
102821  176013  SIM_14

[102822 rows x 2 columns]

In [10]:
tariffs = pd.read_csv(r"tariffs.csv")
tariffs

           pid            TARIFF
0        63422  TARIFF_OPTION_87
1        63423  TARIFF_OPTION_87
2        63424  TARIFF_OPTION_88
3        63425  TARIFF_OPTION_87
4        63426  TARIFF_OPTION_87
...        ...               ...
136942  176009  TARIFF_OPTION_87
136943  176010  TARIFF_OPTION_87
136944  176011  TARIFF_OPTION_87
136945  176012  TARIFF_OPTION_87
136946  176013  TARIFF_OPTION_87

[136947 rows x 2 columns]

In [11]:
channels = pd.read_csv(r"channels.csv")
channels

           pid     CHANNEL
0           61  Onlineshop
1          142  Onlineshop
2          194  Onlineshop
3          247  Onlineshop
4          250  Onlineshop
...        ...         ...
221897  241084   Telesales
221898  242220  Onlineshop
221899  248306  Onlineshop
221900  251575   Telesales
221901  254937  Onlineshop

[221902 rows x 2 columns]

In [12]:
d0 = pd.read_csv(r"hda_dataset_uniform_random_0.csv")
d0

          case                         event                   ts
0            2                Order imported  2018-09-02 00:02:33
1            2            Suspicious (Fraud)  2018-09-02 00:02:46
2            2                 Order checked  2018-09-03 14:26:03
3            2               Device hand-out  2018-09-03 14:27:56
4            2  Ready for payment processing  2018-09-03 14:27:56
...        ...                           ...                  ...
226394  263244      Documents complete (ERP)  2018-12-03 11:26:21
226395  263244              Goods in arrears  2018-12-03 11:28:59
226396  263244              Ready to deliver  2018-12-05 15:23:11
226397  263244                     Delivered  2018-12-05 19:06:27
226398  263244               IMEI correction  2018-12-05 19:19:30

[226399 rows x 3 columns]

In [13]:
d1 = pd.read_csv(r"hda_dataset_uniform_random_1.csv")
d1

          case                     event                   ts
0           17   Export from online shop  2018-09-02 00:11:55
1           17            Order imported  2018-09-02 00:27:29
2           17             Order checked  2018-09-02 00:27:41
3           17           Device hand-out  2018-09-02 00:34:56
4           17         Delivery approved  2018-09-02 00:34:56
...        ...                       ...                  ...
227465  263227  Documents complete (ERP)  2018-12-04 20:59:25
227466  263227          Goods in arrears  2018-12-04 21:48:09
227467  263227          Ready to deliver  2018-12-05 16:06:53
227468  263227                 Delivered  2018-12-06 13:11:46
227469  263227           IMEI correction  2018-12-06 13:13:49

[227470 rows x 3 columns]

In [14]:
d2 = pd.read_csv(r"hda_dataset_uniform_random_2.csv")
d2

          case                    event                   ts
0           40  Export from online shop  2018-09-02 01:25:44
1           40           Order imported  2018-09-02 05:03:19
2           40            Order checked  2018-09-02 05:04:34
3           40          Device hand-out  2018-09-02 05:09:40
4           40        Delivery approved  2018-09-02 05:09:40
...        ...                      ...                  ...
227743  263247                Delivered  2018-12-04 09:27:41
227744  263247                Activated  2018-12-04 09:51:03
227745  263247            Printed (ERP)  2018-12-04 09:51:21
227746  263247  Customer ID transmitted  2018-12-05 09:52:10
227747  263247                 Invoiced  2018-12-05 23:31:18

[227748 rows x 3 columns]

In [15]:
d3 = pd.read_csv(r"hda_dataset_uniform_random_3.csv")
d3

          case                    event                   ts
0           10           Order imported  2018-09-02 00:12:28
1           10            Order checked  2018-09-02 00:12:55
2           10          Device hand-out  2018-09-02 00:22:04
3           10        Delivery approved  2018-09-02 00:22:04
4           10              In delivery  2018-09-02 00:22:04
...        ...                      ...                  ...
227364  263243                Delivered  2018-12-04 18:59:06
227365  263243                Activated  2018-12-04 19:30:40
227366  263243            Printed (ERP)  2018-12-04 19:32:27
227367  263243  Customer ID transmitted  2018-12-05 19:36:55
227368  263243                 Invoiced  2018-12-05 23:31:18

[227369 rows x 3 columns]

In [16]:
d4 = pd.read_csv(r"hda_dataset_uniform_random_4.csv")
d4

          case                          event                   ts
0            1                 Order imported  2018-09-02 00:02:30
1            1                  Order checked  2018-09-02 00:02:41
2            1             Address correction  2018-09-02 00:06:21
3            1  Order creation failed (SYS-2)  2018-09-02 00:07:00
4            1                Device hand-out  2018-09-03 16:36:00
...        ...                            ...                  ...
227148  263244       Documents complete (ERP)  2018-12-03 11:26:21
227149  263244               Goods in arrears  2018-12-03 11:28:59
227150  263244               Ready to deliver  2018-12-05 15:23:11
227151  263244                      Delivered  2018-12-05 19:06:27
227152  263244                IMEI correction  2018-12-05 19:19:30

[227153 rows x 3 columns]

In [17]:
d5 = pd.read_csv(r"hda_dataset_uniform_random_5.csv")
d5

          case                          event                   ts
0            1                 Order imported  2018-09-02 00:02:30
1            1                  Order checked  2018-09-02 00:02:41
2            1             Address correction  2018-09-02 00:06:21
3            1  Order creation failed (SYS-2)  2018-09-02 00:07:00
4            1                Device hand-out  2018-09-03 16:36:00
...        ...                            ...                  ...
227282  263235                    In delivery  2018-12-01 23:45:16
227283  263235               Goods in arrears  2018-12-01 23:45:44
227284  263235               Ready to deliver  2018-12-05 09:48:42
227285  263235                      Delivered  2018-12-06 16:07:51
227286  263235                       Invoiced  2018-12-06 22:46:48

[227287 rows x 3 columns]

In [18]:
d6 = pd.read_csv(r"hda_dataset_uniform_random_6.csv")
d6

          case                     event                   ts
0           15   Export from online shop  2018-09-02 00:09:03
1           15            Order imported  2018-09-02 00:22:32
2           15             Order checked  2018-09-02 00:23:04
3           15           Device hand-out  2018-09-02 00:25:50
4           15         Delivery approved  2018-09-02 00:25:50
...        ...                       ...                  ...
226806  263218  Documents complete (ERP)  2018-12-03 11:25:01
226807  263218          Goods in arrears  2018-12-03 11:27:18
226808  263218          Ready to deliver  2018-12-05 15:56:22
226809  263218                 Delivered  2018-12-06 09:49:28
226810  263218           IMEI correction  2018-12-06 09:51:55

[226811 rows x 3 columns]

In [ ]:
d7 = pd.read_csv(r"hda_dataset_uniform_random_7.csv")
d7

In [ ]:
%sql SELECT * from d1;

In [ ]:
SELECT case FROM d1 JOIN tariffs ON d1.case = tariffs.pid